DELETE FROM `locales_battle_pay_product`;
INSERT INTO `locales_battle_pay_product` (`id`, `title_loc8`, `description_loc8`) VALUES
(1, "Магазин:\nЖетон Пандарии (Номинал: 01)", "Добавляет 1 виртуальное очко для магазина Pandaria 5.4.8"),
(2, "Магазин:\nЖетон Пандарии (Номинал: 02)", "Добавляет 2 виртуальных очка для магазина Pandaria 5.4.8"),
(3, "Магазин:\nЖетон Пандарии (Номинал: 05)", "Добавляет 5 виртуальных очков для магазина Pandaria 5.4.8"),
(4, "Магазин:\nЖетон Пандарии (Номинал: 10)", "Добавляет 10 виртуальных очков для магазина Pandaria 5.4.8");
